{
  "essays": [
    {
      "id": "feed-my-addiction",
      "title": "Feed My Addiction",
      "subtitle": "The Way of Modern Life.",
      "author": "Jevan Goldsmith",
      "date": "2024-07-01",
      "category": "Philosophy",
      "status": "published",
      "content": "<p>In the age of endless scrolling and infinite content, we've become addicted to the very tools designed to set us free. Our smartphones, once heralded as gateways to unlimited knowledge, have become the chains that bind us to a cycle of dopamine-driven consumption.</p><p>Every notification is a siren call. Every like, a tiny hit of validation. We've traded deep thinking for quick hits, meaningful conversation for emojis and GIFs. The irony is palpable: in our quest to stay connected, we've never been more alone.</p><p>But awareness is the first step. Recognizing our digital addictions doesn't mean abandoning technology altogether. Instead, it means being intentional about our usage. It means choosing depth over breadth, quality over quantity.</p><p>The path forward isn't about disconnection—it's about conscious connection. It's about feeding our minds with substance, not just sugar. It's about building relationships that exist beyond the screen.</p><p>So ask yourself: What are you feeding? Your addiction, or your growth?</p>",
      "featuredImage": null,
      "media": [],
      "createdAt": "2024-07-01T00:00:00Z",
      "updatedAt": "2024-07-01T00:00:00Z"
    },
    {
      "id": "beginning-end",
      "title": "The Beginning is the End and the End is the Beginning",
      "subtitle": "A case that what matters are only 'when' matters",
      "author": "Jevan Goldsmith",
      "date": "2024-06-07",
      "category": "Philosophy",
      "status": "published",
      "content": "<p>Time is circular. Or at least, that's how it often feels when you're building something meaningful. Every ending contains within it the seeds of a new beginning. Every beginning is built on the ashes of what came before.</p><p>In business, in life, in relationships—we're constantly cycling through these phases. The trick isn't to avoid the endings or rush to the beginnings. The trick is to recognize that they're the same thing, viewed from different angles.</p><p>When a project fails, it's not truly an end. It's the beginning of wisdom. When you start something new, you're not starting from zero—you're starting from everything you've learned.</p><p>The question \"when\" becomes critical here. When do you recognize an ending? When do you embrace a new beginning? These moments of transition are where life happens, where growth occurs.</p><p>Most people fear endings because they see them as failures. But what if every ending is just a beginning you haven't recognized yet? What if the timing of your awareness is the only thing that separates success from failure?</p><p>The beginning is the end. The end is the beginning. It's all about when you choose to see it.</p>",
      "featuredImage": null,
      "media": [],
      "createdAt": "2024-06-07T00:00:00Z",
      "updatedAt": "2024-06-07T00:00:00Z"
    },
    {
      "id": "hot-spas",
      "title": "Hot Spas Never go out of Style - A lesson on Culture",
      "subtitle": null,
      "author": "Jevan Goldsmith",
      "date": "2024-06-05",
      "category": "Management",
      "status": "published",
      "content": "<p>Every great company that has lasted was built on a solid foundation set only by a great culture. There is no single greater force that can put a great business out of business faster than ineffective warm culture.</p><p>Think about it: Hot tubs and spas have been around for centuries. From ancient Roman baths to modern luxury resorts, the concept endures. Why? Because the core value proposition never changes—relaxation, rejuvenation, community.</p><p>The same principle applies to organizational culture. A truly hot culture—one that's energizing, welcoming, and purposeful—never goes out of style. It attracts talent. It retains people. It drives performance.</p><p>But here's the catch: most companies don't have a hot culture. They have a warm one. Comfortable enough that people don't leave immediately, but not exciting enough to inspire greatness. It's the corporate equivalent of a lukewarm bath—nobody wants to stay in it for long.</p><p>Warm cultures are dangerous because they're insidious. They feel okay. They don't trigger alarm bells. But over time, they erode motivation, stifle innovation, and create mediocrity.</p><p>Building a hot culture requires intention. It means:</p><ul><li>Being clear about your values and actually living them</li><li>Creating an environment where people feel psychologically safe to take risks</li><li>Celebrating wins and learning from failures openly</li><li>Investing in people's growth, not just their output</li><li>Having the courage to say no to people who don't fit, even if they're talented</li></ul><p>The temperature of your culture is set at the top. Leaders who are lukewarm create lukewarm cultures. Leaders who bring heat—passion, clarity, intensity—create cultures that last.</p><p>So ask yourself: Is your organization a hot spa or a warm bath? Because in the long run, only one of those will keep people coming back.</p>",
      "featuredImage": null,
      "media": [],
      "createdAt": "2024-06-05T00:00:00Z",
      "updatedAt": "2024-06-05T00:00:00Z"
    }
  ],
  "lastUpdated": "2024-07-01T00:00:00Z"
}
